In [2]:
import random
import sklearn
import pandas as pd
import numpy as np

In [6]:
testdata = pd.DataFrame({'pet':['cat', 'dog', 'dog', 'fish', 'cat', 'dog', 'cat', 'fish'],
                         'age': [4., 6, 3, 3, 2, 3, 5, 4],
                         'salary':   [90, 24, 44, 27, 32, 59, 36, 27]})
testdata

   age   pet  salary
0  4.0   cat      90
1  6.0   dog      24
2  3.0   dog      44
3  3.0  fish      27
4  2.0   cat      32
5  3.0   dog      59
6  5.0   cat      36
7  4.0  fish      27

In [7]:
testdata.query('age < 4')

   age   pet  salary
2  3.0   dog      44
3  3.0  fish      27
4  2.0   cat      32
5  3.0   dog      59

In [9]:
testdata.query('age < 4 and pet=="dog"')

   age  pet  salary
2  3.0  dog      44
5  3.0  dog      59